Revit 2027 API
FabricationConfiguration.GetAllUsedServices Method
 Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationService> GetAllUsedServices()
Public Function GetAllUsedServices As IList(Of FabricationService)
public:
IList<FabricationService^>^ GetAllUsedServices()
member GetAllUsedServices : unit -> IList<FabricationService>
Return Value
IList<FabricationService>
 All the used fabrication services.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace